{
  "Resume": "Resume",
  "ProfileTitle": "Profile",
  "Profession": "I'm a Web Systems Engineer",
  "About me": "About Me",
  "Download resume": "Download Resume",
  "my description": "I’m a web systems engineer and WordPress Enthusiast. I’m Costa Rican but I’m also fluent in english. I’m not the typical geek, i’m outgoing and very social. However I do love video games but also traveling, craft beer and all sorts of food. I like beeing part of interesting and challenging projects that bring out the best of me and my abilities as an engineer.",
  "Experiences" : "Experiences",
  "Education" : "Education",
  "Educations" : {
    "1" : {
      "Title" : "Licentiate - Computer Science (Specialization: Web Systems)",
      "Description" : "Education was web development focused with PHP, HTML, CSS, Javascipt, Ajax, Apache, MySQL, jQuery. During this time in university I specialized in web development. Here I did my thesis project: 'PIEUNA' a Joomla based social network for Universidad Nacional alumni. I also learned about Project Management and Research Design."
    },
    "2" : {
      "Title" : "Bachelor - Computer Science",
      "Description" : "Education was mainly theoretical. However I also did a project for a private school called 'Kid's Land' that involved creating a website with Joomla and a virtual classroom with Moodle. I learned C#, Visual Basic, Python, Linux Servers Administration, Web Development and Educational Applications design."
    },
    "3" : {
      "Title" : "Diploma - Computer Science",
      "Description" : "Education was mainly C++ based programming but I also learned about HTML, CSS, PHP, MVC, UML, Java, Networking, Database Administration, Linux, Tech Support, Object Oriented Programming, English, Calculus, Linear Algebra, Probability and Statistics, Discrete Mathematics and more."
    }
  },
  "Careers" : "Careers",
  "CareersExp" : {
    "1" : {
      "Title" : "Full-time - Back-end Developer",
      "Description" : "I worked as a Back-end Developer in projects like Marriott-Hotels.com, GBC-Education.org and more. Mostly using technologies such as Laravel, WordPress, SASS, Javascript, Node, Gulp, Bower, PHP, Lando, Docker, Pantheon, WP-Engine, Jenkins and more. I also was introduced to working with Git Flow, coding standards and code reviews."
    },
    "2" : {
      "Title" : "Full-time - Senior Web Master",
      "Description" : "I learned a lot of website security and monitoring, malware removal, SEO optimization, website development with CMS, Joomla and WordPress plugin and theme development from scratch, Linux Server Management, Bash Scripting, WHM/Cpanel and more. I implemented usage of GIT for collaborative development."
    }
  },
  "ResumeURL" : "https://docs.google.com/document/d/1nmJ-xjhzjXZ5o7FGsLGMZmVV-dihPPN63EVRm9uvciI/export?format=pdf",
  "Abilities" : "Abilities",
  "Skills" : "Skills",
  "Web Development" : "Web Development",
  "&" : "&",
  "Website Malware Removal" : "Website Malware Removal",
  "Networking" : "Networking"
}