{
  "Resume": "Curriculum Vitae",
  "ProfileTitle": "Perfil",
  "Profession": "Soy un Ingeniero en Sistemas Web y desarrollador de VR / XR / Videojuegos",
  "About me": "Sobre Mi",
  "Download resume": "Descargar CV",
  "my description": "Soy un Ingeniero en Sistemas y entusiasta de WordPress actualmente trabajando en desarrollar aplicaciones VR/XR y WebGL con frameworks web y motores de desarrollo de videojuegos Unity y Unreal Engine. Soy costarricense pero también soy fluido en inglés. No soy el típico informático, me gusta salir y soy muy social. Pero si me encantan los videojuegos y también viajar, la cerveza artesanal y todo tipo de comidas. Me gusta ser parte de proyectos retadores e interesantes que sacan lo mejor de mi como ingeniero.",
  "Experiences" : "Experiencias",
  "Education" : "Educación",
  "Educations" : {
    "1" : {
      "Title" : "Licenciatura - Ingeniería en Sistemas (énfasis en Sistemas Web)",
      "Description" : "Educación enfocada en el desarrollo web con PHP, HTML, CSS, Javascipt, Ajax, Apache, MySQL, jQuery. Aquí hice mi proyecto de tesis: 'PIEUNA' una red social para egresados de la Universidad Nacional basada en Joomla. También aprendí sobre Administración de Proyectos y Diseño de Investigaciones."
    },
    "2" : {
      "Title" : "Bachillerato - Ingeniería en Sistemas",
      "Description" : "Educación principalmente teórica. También hice un proyecto para una escuela privada llamada 'Kid's Land' que consistió en crear un sitio web con Joomla y un aula virtual con Moodle. Aprendí C#, Visual Basic, Python, Administración de Servidores Linux, Desarrollo Web y Diseño de Aplicaciones Educativas."
    },
    "3" : {
      "Title" : "Diplomado - Ingeniería en Sistemas",
      "Description" : "Educación principalmente basada en programación con C++, pero también aprendí HTML, CSS, PHP, MVC, UML, Java, Redes, Bases de Datos, Linux, Soporte Técnico, Programación Orientada a Objetos, Inglés, Cálculo, Algebra Lineal, Probabilidad y Estadística, Matemática Discreta, entre otros cursos."
    }
  },
  "Careers" : "Empleos",
  "CareersExp" : {
    "1" : {
      "Title" : "Tiempo Completo - Desarrollador Back-end",
      "Description" : "Trabajé como Back-end Developer en proyectos como Marriott-Hotels.com, GBC-Education.org y más. Principalmente utilizando tecnologías como Laravel, WordPress, SASS, Javascript, Node, Gulp, Bower, PHP, Lando, Docker, Pantheon, WP-Engine, Jenkins y más. También comencé a utilizar Git Flow, estándares de programación y gestión de calidad del código."
    },
    "2" : {
      "Title" : "Tiempo Completo - Web Master Senior",
      "Description" : "Aprendí mucho sobre monitoreo y seguridad de sitios web, eliminación de malware, SEO, desarrollo web con CMS, desarrollo de extensiones y temas para Joomla y WordPress, Administración de Servidores Linux, Scripts de Bash, WHM/Cpanel y más. Implementé el uso de GIT para el desarrollo colaborativo."
    },
    "3" : {
      "Title" : "Tiempo Completo - Desarrollador Front-end WordPress",
      "Description" : "En este trabajo puse en práctica todas las habilidades adquiridas en puestos anteriores pero también comencé a trabajar más en tareas propias de front-end. Ahí aprendí sobre sub-módulos de Git, desarrollar navwalkers personalizados para WordPress, extender temas padres en WordPress, Webpack y construir y montar imágenes personalizadas de Docker."
    },
    "4" : {
      "Title" : "Tiempo Completo - Analista Desarrollador Web Senior",
      "Description" : "Desarrollé más proyectos WordPress incluyendo su uso como headless CMS para clientes Angular y React. Configuré flujos CI/CD para automatizar el compilado y lanzamiento de nuevas versiones de los diferentes proyectos. Manejé una cuenta AWS completa para un equipo pequeño de desarrolladores React al mismo tiempo desarrollando yo también 50% de mi tiempo, creando nuevos componentes y lógica, configuré servicios AWS requeridos por diferentes aplicaciones, manejé los estándares de seguridad de los diferentes recursos AWS, utilicé servicios AWS para configurar flujos CI/CD: CodeCommit, CodeBuild, S3 buckets, Lambda Functions, configuré aplicaciones web hospedads en buckets S3 utilizando AWS CloudFront y finalmente ayudé a migrar algunos microservicios de varios proyectos a Kubernetes"
    },
    "5" : {
      "Title" : "Tiempo Completo - Analista de Desarrollo de Aplicaciones Senior",
      "Description" : "Desarrollé SDK Apps (MREs) personalizados para proyectos de Altspace VR incluyendo reproductores de video, accesorios para el avatar, activar diferents animaciones incluidas en kits de Altspace y modelos 3D GLTF/GLB, además de sincronizar animaciones entre varios objetos 3D. Programé lógica en C# para un proyecto VR y para WebGL hecho en Unitypara entrenamientos virtuales, simulación y evaluación de los diferents riesgos de incendio para una compañía eléctrica. También probé y mejoré el desempeño de una plicación VR desarrolada en Unreal Engine además de modificar lógica blueprints pre-existente y agregar logica nueva. Aprendí modelado 3D básico y desarrollé addons personalizados de Blender hechos con Python."
    }
  },
  "ResumeURL" : "https://docs.google.com/document/d/1HBoIXgjFtTr92RjTrpF2dN033OOEuj5h1ZKXDrZhOSE/export?format=pdf",
  "Abilities" : "Habilidades",
  "Skills" : "Destrezas",
  "Web Development" : "Desarrollo Web",
  "&" : "y",
  "Website Malware Removal" : "Limpieza de Walware Web",
  "Networking" : "Redes",
  "Game Development" : "Desarrollo de Videojuegos",
  "Test Automation" : "Automatización de Pruebas",
  "Continuous Integration/Delivery" : "Integración Continua",
  "Photo, Video & Audio Editing" : "Edición de Fotos, Audio y Video",
  "GitHub Profile" : "Perfil de GitHub",
  "Languages" : "Lenguajes",
  "English" : "Inglés",
  "Spanish" : "Español",
  "Costa Rican Sign Language" : "Lengua de Señas Costarricense",
  "Native" : "Nativo",
  "Tools" : "Herramientas",
  "Illustrator & Inkscape" : "Ilustrador e Inkscape",
  "Projects" : "Proyectos",
  "Contact" : "Contacto",
  "Now" : "Actual",
  "January" : "Enero",
  "February" : "Febrero",
  "March" : "Marzo",
  "April" : "Abril",
  "May" : "Mayo",
  "June" : "Junio",
  "July" : "Julio",
  "August" : "Agosto",
  "September" : "Septiembre",
  "October" : "Octubre",
  "November" : "Noviembre",
  "December" : "Diciembre",
  "Portfolio" : "Portafolio"
}